"""
цей алгоритм допомагає знайти найБІЛЬШИЙ спільний дільник числа (НСД)
# дано числа a, b:
    # поки a != b:
        # знаходимо більше з них
        # зменшуємо його на значення меншого
# виводимо a чи b

# Якщо НСД(a, b) = 1, то a і b є взаємопростими числами:
13 і 5
11 і 7
"""

# a, b = int(input()), int(input())
# while a != b:
#     if a > b:
#         a = a-b
#     else:
#         b = b-a
# print(a)


"""
якщо одне з чисел ділиться націло (без остачі) на друге число, то НСД буде рівне меншому числу.
1000 і 2 => НСД=2
50 і 150 => НСД=50

Якщо ж є два числа. які НЕ діляться без остачі одне на одного, тоді
НСД для цих чисел буде остача від ділення більшого на менше:
25 і 105: НСД = 5 (105 % 25 = 5)
"""


a, b = int(input()), int(input())
while b > 0:
    a, b = b, a % b
print(a)

# a * b = НСД * НСK
