"""
Django - web-framework, фреймворк для створення сайтів.
Framework - програма, що складається з кількох компонент, де вже вирішено стандартні проблеми, напр.:
адмінка на сайтах, форми заповнення/відображення даних на сайтах, процедури логування, автентифікації, кешування...
Фреймворк складається з компонент, які і вирішують ці задачі.
Django ставиться як звичайний зовнішній модуль в Пайтоні - через рір (пакетний менеджер Пайтона): pip install django.
Яка різниця між бібліотекою/модулем і фреймворком?
Коли ми пишемо код за допомогою бібліотеки, то ми самі вирішуємо де і коли потрібно вставляти код з бібліотеки всередину у нашу програму
і бібліотека ніяк не впливає на наш вибір.
А коли ми користуємось фреймворком, то фреймворк нам дає правила написання коду, і відповідно ми повинні слідувати цим правилам
і наш код буде підлаштовуватись під ці правила, звідси виникає залежність, оск ми повинні лідувати тим правилам, які нам дає фреймворк.

Отже, користуючись бібліотекою - код бібліотеки вбудовується в наш код.
а користуючись фреймворком - наш код підлаштовується під фреймворк.

Зовнішній модуль/бібліотека - програма, в якій вже закладена певне функціональність, написана іншими розробниками.
Для встановлення зовнішнього модуля нам потрібен пакетний менеджер Пайтона - рір
"""
