# sorted() - вбудована функція, яку можна застосувати до ітерабельних об"єктів, не змінює початкового колекцію,
# щоб змінити початкуову колекцію, потрібно зробити присвоєння
x = [1, 4, 2, 6, 5, 9, 0]
print(x)   # [1, 4, 2, 6, 5, 9, 0]
x = sorted(x)
print(x)   # [0, 1, 2, 4, 5, 6, 9]


# sort() - метод списків. НЕ потребує присвоєння, змінює початковий список
q = [1, 4, 2, 6, 5, 9, 0]
print(q)   # [1, 4, 2, 6, 5, 9, 0]
q.sort(reverse=True)
print(q)   # [9, 6, 5, 4, 2, 1, 0]

s = "Бросай курить Бросай курить"
s = s.split()
print('\n'.join(s))