"""
цей алгоритм допомагає знайти найбільший спільний дільник числа (НСД)
# дано числа a, b:
    # поки a != b:
        # знаходимо більше з них
        # зменшуємо його на значення меншого
# виводимо a чи b
# Якщо НСД(a, b) = 1, то a і b є взаємопростими числами.
"""
a, b = int(input()), int(input())
while a != b:
    if a > b:
        a = a-b
    else:
        b = b-a
print(a)


# # (2)
# якщо одне з чисел ділиться націло (без остачі) на друге число, то НСД буде рівне меншому з них числу.
a, b = int(input()), int(input())
while b > 0:
    a, b = b, a % b
print(a)

# a * b = НСД * НСK
