# Задача «Максимальное число идущих подряд равных элементов»
# Дана последовательность натуральных чисел, завершающаяся числом 0.
# Определите, какое наибольшее число подряд идущих элементов этой последовательности равны друг другу.

n = int(input())
previous_n = n
maxx_amount = 1
amount = 1
while n != 0:
    n = int(input())
    if n == previous_n:
        amount = amount + 1
    # якщо n != previous_n, то це означає, що пачка однакових елементів закінчилась і
    # ми порахували к-сть однакових елементів, що йдуть підряд, і тепер
    # потрібно цю обчислену к-сть перевірити з існуючою максимальною кількістю однакових елементів, що йдуть підряд,
    # і при потребі замінити значення максимальної кількості на дане обчислене значення
    # і заново почати обрахунок к-сті однакових елементів, що ідуть підряд, вже для нового блоку елементів
    else:   # виконується тоді, коли ми переходимо з одної пачки на іншу: тобто околи n != previous_n
        if amount > maxx_amount:
            maxx_amount = amount
        amount = 1
    previous_n = n
print(maxx_amount)

# перевіряємо елементи (чи вони однакові)
# якщо однакові - збільшуємо кількість
# якщо НЕ однакові - перевіряємо обчислену к-сть з максимальною і
    # і при потребі міняємо значення максимальної кількості на дане обчислене значення
# для нового блоку елементів заново обраховуємо к-сть однакових елементів, що ідуть підряд
