"""
"Новый год и спешка"

В последний день уходящего 2016 года Лимак собирается принять участие в соревновании по спортивному программированию.
Соревнование начнётся в 20:00 и будет продолжаться четыре часа, то есть ровно до полуночи.
Участникам будет предложено n задач, упорядоченных по возрастанию сложности, то есть задача 1 будет самой лёгкой,
а задача номер n — самой сложной. Лимак знает, что ему потребуется 5·i минут на решение i-й задачи.

Друзья Лимака планирую устроить роскошную новогоднюю вечеринку и Лимак хочет прибыть в полночь или ранее.
Он знает, что ему требуется ровно k минут чтобы добрать до места проведения вечеринки от своего дома,
где он собирается участвовать в соревновании.

Сколько максимум задач может успеть решить Лимак, так чтобы не опоздать на новогоднюю вечеринку?

Входные данные
В первой строке входных данных записаны два целых числа n и k (1≤n≤10, 1≤k≤240) —
количество задач в соревновании и количество минут, за которое Лимак доберётся от дома до места проведения вечеринки.

Выходные данные
Выведите одно целое число, равное максимальному количеству задач, которое может решить Лимак,
так чтобы прибыть на новогоднюю вечеринку ровно в полночь или раньше.

Sample Input 1:
3 222
Sample Output 1:
2

Sample Input 2:
4 190
Sample Output 2:
4

Sample Input 3:
7 1
Sample Output 3:
7

Sample Input 4:
1 240
Sample Output 4:
0

Sample Input 5:
10 1
Sample Output 5:
9
"""

n_zadach, t_na_dorogu = map(int, input().split())
t_na_zadachi = 240 - t_na_dorogu
i = 0
t_used = 0
while t_used <= t_na_zadachi:
    i += 1
    t_used = t_used + (5 * i)
print(i - 1)
