# builtins (вбудована) область видимості:
# в неї входять всі вбудовані ф-ії (abs, print,...), об"єкти, змінні, та ключові слова (False, else, for, in ...)
# і щоб побачити повний список вбудованої області видимості, потрібно натиснути Ctrl + Space.
# Ctrl + Space --> list of builtins

a = [1,2,3,4,5,6]

# Імена із вбудованої області видимості (окрім ключових слів) можна перевизначати:
# перевизначаємо функцію abs (модуль числа)
# def w(x):
#     return x**2
# abs = w
# print(abs(-7), abs(5))  # 49, 25, а не 7 і 5

# перевизначаємо функції min, max:
# min, max = max, min


# Імена із вбудованої області видимості (окрім ключових слів) можна перевизначати і всередині ф-ії:
def f():
    abs = 10   # тут abs має локальне значення 10
    return abs

print(f())
