# 1. ПОЗИЦІЙНИЙ: при виклику ф-ії передаємо стільки аргументів, скільки приймає функція.
# передані у ф-ію аргументи будуть присвоюватись відповідно змінним у порядку, в якому вони стоять у ф-ії:
# a = 1, b = 2, c = 3

def f(a, b, c):
    print(a, b, c)
f(1, 2, 3)
# 1 2 3

# 2. ПО ІМЕНІ: імена аргументів, що передаються у ф-ію при її виклику,
# мають співпадати з іменами змінних, які приймає ф-ія.

def ff(a, b, c):
    print(a, b, c)
ff(b=10, c=20, a=100)
# 100 10 20


# 3. КОМБІНОВАНИЙ ВАРІАНТ: при комбінованому варіанті спершу вказуються аргументи позиційні, а вже потім ідуть іменовані
def fff(a, b, c):
    print(a, b, c)
fff(11, c=22, b=111)
# 11 111 22


# 4. Також при оголошенні ф-ії можна присвоювати змінним значення по-замовчуванню.
# При виклику ф-ії можна тепер передавати лише ті аргументи, які не мають дефолтних значень.
# Якщо ж передати значення змінним, які мають значення по замовчуванню, то дефолтні значення перезапишуться.

def s(a, b, c = "hello"):
    print(a, b, c)
s(11, b=111)
# 11 111 hello

# Якщо ВСІ змінні, які приймає ф-ія мають значення по замовчуванню,
# то ф-ію можна викликати як БЕЗ параметрів, так і з параметрами.

def ss(a = 555, b = 777, c = "hello"):
    print(a, b, c)
ss()   # 555 777 hello
ss(50)   # 50 777 hello
ss(50, 70)   # 50 70 hello
ss(50, 70, "99")   # 50 70 99

# оголошуючи ф-ію, спершу маються іти всі ОБОВ"ЯЗКОВІ змінні, а потім ті, які мають дефолтні значення:
# def sss(a, b, c = "hello")   # a, b - ОБОВ"ЯЗКОВІ, потім c - з дефолтним значенням.
