"""
Моностан - це коли всі об"єкти класу мають однакове значення отрибутів.
Змінюючи значення атрибуду в одному об"єкті, ми тим самим вносимо зміни у всі решта об"єктів.
При зміні одного атрибуту, ці зміни поширюються на всі решту екземплярів класу.
Всі зроблені зміни з існуючими екземплярами(створення нового атрибуту, чи зміна значення існуючого атрибуту)
будуть надалі стосуватись/поширюватись на нові екземпляри.
Ця поведінка досягається за доп того, що використовується атрибут класу (напр. який є словником),
а в ініті у магічну змінну об"єкту __dict__ присвоюється посилання на атрибут класу (Cat.__shared_attr):
self.__dict__ = Cat.__shared_attr
отже в кожному екземплярі класу буде зберіг-ся посилання на один і той же ж об"єкт атрибут класу (Cat.__shared_attr)
"""
class Cat:
    breed = 'pers'
    __shared_attr = {
        'breed': 'pers',
        'color': 'black'
    }

    def __init__(self):
        self.__dict__ = Cat.__shared_attr


"""

"""