# відкриваючи файл у режимі 'w', ми вказуємо намір, з яким ми відкриваємо даний файл,
# але якщо файлу ще НЕ існує, то ми одразу і створюємо файл
f = open('test1.txt', 'w')
f.write("HELLO")
# викликавиши ще раз метод write() ми дозапишемо слово без пробілу вкінець того ж рядка
f.write("  СВІТ")


ff = open("test2.txt", "w")
lines = ["Line1", "Line2", "Line3"]
contents = "\n".join(lines)
print(repr(contents))
# 'Line1\nLine2\nLine3'
print(contents)
# Line1
# Line2
# Line3
ff.write(contents)

# відкриваючи файл у режимі 'а', ми вказуємо намір, з яким ми відкриваємо даний файл (намір дозаписувати вкінець файлу)
# а також якщо файлу ще НЕ існує, то ми одразу і створюємо файл
# запустивши кілька разів файл з командою f1.write("bye\n"), ми побачимо, ща наш файл виріс у стільки раз,
# скільки раз ми запускали дану програму
f1 = open("test_append.txt", 'a')
f1.write("bye\n")


f1.close()
ff.close()
f.close()