# s = input()
s = 'Abrakadabra'
# ВИВЕСТИ ТРЕТІЙ СИМВОЛ СТРОКИ
print(s[2])       # r

# ВИВЕСТИ ПЕРЕДОСТАННІЙ СИМВОЛ СТРОКИ
print(s[-2])      # r

# ВИВЕСТИ ПЕРШІ 5 СИМВОЛІВ СТРОКИ
print(s[:5])      # Abrak

# ВИВЕСТИ СИМВОЛИ СТРОКИ ОКРІМ ОСТАННІХ ДВОХ
print(s[:-2])     # Abrakadab

# ВИВЕСТИ СИМВОЛИ СТРОКИ ЧЕРЕЗ ОДИН, ПОЧИНАЮЧИ ВІД ПЕРШОГО (ВСІ ПАРНІ ІНДЕКСИ/СИМВОЛИ)
print(s[::2])     # Arkdba

# ВИВЕСТИ СИМВОЛИ СТРОКИ ЧЕРЕЗ ОДИН, ПОЧИНАЮЧИ ВІД ДРУГОГО (НЕПАРНІ ІНДЕКСИ/СИМВОЛИ)
print(s[1::2])    # baaar

# ВИВЕСТИ СТРОКУ У ЗВОРОТНЬОМУ ПОРЯДКУ
print(s[::-1])    # arbadakarbA

# ВИВЕСТИ КОЖЕН ДРУГИЙ СИМВОЛИ СТРОКИ, ПОЧИНАЮЧИ З ОСТАННЬОГО
print(s[::-2])    # abdkrA

# ВИВЕСТИ ОСТАННІ ТРИ СИМВОЛИ СТРОКИ
print(s[-3:])   # bra

# print(len(s))   # 11
